// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   TypeStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell type command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_TYPE_ARG_ZERO_LENGTH       #language eng  "%hs: Argument with zero length is not allowed\n"

#string STR_TYPE_CANNOT_ASCII          #language eng  "%hs: Cannot use ASCII and Unicode at the same time\n"

#string STR_TYPE_TARGET_DIR            #language eng  "%hs: Target %hs is a directory\n"

#string STR_TYPE_FILE_SIZE             #language eng  "%hs: %s, Size %ld%N\n\n"

#string STR_TYPE_OUT_OF_MEM            #language eng  "%hs: Out of memory\n"

#string STR_TYPE_TWO_VARS_PTR_S        #language eng  "%.*s"

#string STR_TYPE_TWO_VARS_PTR_A        #language eng  "%.*a"

#string STR_TYPE_TOO_ENTER_Q           #language eng  "Press ENTER to continue, 'q' to exit: "

#string STR_TYPE_TEMPCOLUMN            #language eng  "\r%*a\r"

#string STR_TYPE_TYPE_ERROR            #language eng  "%hs: Type %hs error - %r\n"

#string STR_TYPE_FILE_CONLICT          #language eng  "%hs: Cannot output to file %hs itself\n"

#string STR_TYPE_RETURN                #language eng  "\n"

#string STR_TYPE_LINE_HELP             #language eng  "Displays the contents of a file"

#string STR_TYPE_VERBOSE_HELP          #language eng  "Displays the contents of a file on the standard output device.\n"
                                                      "\n"
                                                      "TYPE [-a|-u] file [file...]\n"
                                                      "\n"
                                                      "    -a     - Displays the file as ASCII characters\n"
                                                      "    -u     - Displays the file as Unicode characters\n"
                                                      "    file   - Name of file to display\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "\n"
                                                      "  * To display the file as Unicode characters:\n"
                                                      "    fs0:\\> type -u pause.nsh\n"
                                                      "    File: fs0:\\pause.nsh, Size 204\n"
                                                      "    #\n"
                                                      "    #  Example script for 'pause' command\n"
                                                      "    #\n"
                                                      "    echo pause.nsh begin..\n"
                                                      "    date\n"
                                                      "    time\n"
                                                      "    pause\n"
                                                      "    echo pause.nsh done.\n"
                                                      "\n"
                                                      "  * TO display the file as ASCII characters:\n"
                                                      "    fs0:\\> type -a pause.nsh\n"
                                                      "    File: fs0:\\pause.nsh, Size 204\n"
                                                      "     #\n"
                                                      "     #     E x a m p l e   s c r i p t   f o r   ' p a u s e '   c o m m a n d\n"
                                                      "     #\n"
                                                      "     e c h o   p a u s e . n s h   b e g i n . .\n"
                                                      "     d a t e\n"
                                                      "     t i m e\n"
                                                      "     p a u s e\n"
                                                      "     e c h o   p a u s e . n s h   d o n e .\n"
                                                      "\n"
                                                      "  * To type multiple files at a time:\n"
                                                      "    fs0:\\> type test.*\n"
                                                      "    File: fs0:\\test.txt, Size 23\n"
                                                      "            How to Install?\n"
                                                      "    File: fs0:\\test.nsh, Size 48\n"
                                                      "    time\n"
                                                      "    stall 3000000\n"
                                                      "    time\n"

 


